% Пункт 1: Інформація про функцію compet
Name = compet('name');         % Назва функції
Dname = compet('deriv');       % Назва похідної
Inrange = compet('active');     % Діапазон входу
Outrange = compet('output');    % Діапазон виходу

disp('Інформація про функцію compet:');
disp(['Назва: ' Name]);
disp(['Назва похідної: ' Dname]);
disp(['Діапазон входу: ' num2str(Inrange)]);
disp(['Діапазон виходу: ' num2str(Outrange)]);

% Пункт 2: Побудувати стовпцеві діаграми для вектора входу та виходу
N = [0; 1; -0.5; 0.5];
A = compet(N);

subplot(2,1,1);  % 2x1 підвікно; вивід у 1-е підвікно
bar(N);          % стовпчаста діаграма вектора входу
ylabel('n');      % мітка осі ординат

subplot(2,1,2);  % друге підвікно
bar(A);          % стовпчаста діаграма вектора виходу
ylabel('a');      % мітка осі ординат