import 'package:flutter/material.dart';

class PoetInfo {
  final String name;
  final String imageAsset;
  final String description;

  PoetInfo({
    required this.name,
    required this.imageAsset,
    required this.description,
  });
}

final List<PoetInfo> poets = [
  PoetInfo(
    name: 'Іван Франко',
    imageAsset: 'assets/img/franko.jpg',
    description: 'Іва́н Я́кович Франко́ (27 серпня 1856, Нагуєвичі, Дрогобицький повіт, '
        'Самбірський округ, Королівство Галичини та Володимирії, Австрійська Імперія — '
        '28 травня 1916, Львів, Долитавщина, Австро-Угорщина) — видатний український поет, '
        'прозаїк, драматург, літературний критик, публіцист, перекладач, науковець, громадський '
        'і політичний діяч. Доктор філософії (1893), доктор габілітований (1895), дійсний член '
        'Наукового товариства імені Шевченка (1899), почесний доктор Харківського університету '
        '(1906). Член Всеукраїнського Товариства «Просвіта». Упродовж своєї понад 40-літньої '
        'творчої активності Франко надзвичайно плідно працював як оригінальний письменник (поет, '
        'прозаїк, драматург) і перекладач, літературний критик і публіцист, багатогранний науковець '
        '— літературо-, мово-, перекладо- й мистецтвознавець, етнолог і фольклорист, історик, соціолог, '
        'політолог, економіст, філософ. Його творчий доробок, писаний українською (більшість текстів), '
        'польською, німецькою, російською, болгарською, чеською мовами, за приблизними оцінками налічує '
        'кілька тисяч творів загальним обсягом понад 100 томів. Усього за життя Франка окремими книгами і '
        'брошурами було понад 220 видань, у тому числі понад 60 збірок його оригінальних і перекладних творів '
        'різних жанрів. Він був одним із перших професійних українських письменників, тобто заробляв на життя літературною працею.',
  ),
  PoetInfo(
    name: 'Леся Українка',
    imageAsset: 'assets/img/ukrainka.jpg',
    description: 'Ле́ся Украї́нка (справжнє ім`я — Лари́са Петрі́вна Ко́сач, у шлюбі Ко́сач-Кві́тка; 13 (25) лютого 1871, Новоград-Волинський, '
    'Волинська губернія, Російська імперія — 19 липня (1 серпня) 1913, Сурамі, Тифліська губернія, Російська імперія (нині Грузія)) — українська '
    'письменниця, перекладачка та культурна діячка, співзасновниця літературного гуртка «Плеяда» та групи Українська соціал-демократія. '
    'У сучасній українській традиції входить до переліку найвідоміших жінок давньої та сучасної України[8]. Писала в жанрах поезії, лірики, '
    'епосу, драми, прози, публіцистики, розвинула жанр драматичної поеми в українській літературі. Працювала в галузі фольклористики (наспівала '
    '220 народних мелодій) і активно долучалася до процесів українського жіночого руху та національного відродження. Серед мистецької '
    'спадщини — збірки поезій «На крилах пісень» (1893), «Думи і мрії» (1899), «Відгуки» (1902), поеми «Давня казка» (1893), «Одно слово» (1903), драми-поеми «Кассандра» (1901—1907), «В катакомбах» (1905), «Лісова пісня» (1911), «Камінний господар» (1912), «Бояриня» (1913).',
  ),
  PoetInfo(
    name: 'Олена Пчілка',
    imageAsset: 'assets/img/pchilka.jpg',
    description: 'О́льга Петрі́вна Ко́сач, до шлюбу Драгома́нова, відома під псевдонімом Оле́на Пчі́лка; 17 (29) червня 1849, Гадяч, Полтавська губернія'
        ' — 4 жовтня 1930, Київ) — українська письменниця, меценатка, перекладачка, етнографка, фольклористка, публіцистка, громадська діячка '
        '(учасниця національно-визвольного та феміністичного рухів), член-кореспондент Всеукраїнської академії наук (1925). В 1887 році з'
        ' Наталією Кобринською видала у Львові першу в Україні феміністичну збірку: альманах «Перший вінок». Мати поетеси Лесі Українки, Михайла '
        'Косача, Ольги Косач-Кривинюк, Оксани Косач, Миколи Косача та Ізидори Косач-Борисової (у шлюбі з Петром Косачем), старший брат — професор Михайло Драгоманов.',
  ),
  PoetInfo(
    name: 'Павло Тичина',
    imageAsset: 'assets/img/tichina.jpg',
    description: 'Павло́ Григо́рович Тичи́на (11 [23] січня 1891, Піски, Щаснівська волость, Козелецький повіт, Чернігівська губернія, Російська імперія, нині — '
        'Бобровицька міська об`єднана територіальна громада, Ніжинський район, Чернігівська область, Україна — 16 вересня 1967, Київ, Українська РСР, '
        'СРСР) — український радянський поет, перекладач, публіцист, політик, громадський та державний діяч доби УНР та УРСР. Старший брат Євгена Тичини.',
  ),
  PoetInfo(
    name: 'Тарас Шевченко',
    imageAsset: 'assets/img/shevchenko.jpg',
    description: 'Тара́с Григо́рович Шевче́нко (25 лютого (9 березня) 1814, с. Моринці, Київська губернія, Російська імперія (нині Звенигородський район, Черкаська область, Україна) '
        '— 26 лютого (10 березня) 1861, Санкт-Петербург, Російська імперія) — український поет, прозаїк, мислитель, живописець, гравер, етнограф, громадський діяч. '
        'Національний герой і символ України. Діяч українського національного руху, член Кирило-Мефодіївського братства. Академік Імператорської академії мистецтв (1860).',
  ),
  PoetInfo(
    name: 'Володимир Сосюра',
    imageAsset: 'assets/img/sosyura.jpg',
    description: 'Володи́мир Микола́йович Сосю́ра (25 грудня 1897 [6 січня 1898], ст. Дебальцеве, Катеринославська губернія, Російська імперія — 8 січня 1965, '
        'Київ, Українська РСР, СРСР) — видатний український поет, письменник та перекладач. Автор понад 40 збірок поезій, широких епічних віршованих полотен '
        '(поем), роману «Третя Рота», бунчужний 3-го Гайдамацького полку Армії УНР. Належав до низки літературних організацій того періоду — «Плуг», «Гарт», '
        '«ВАПЛІТЕ» та інших. Кавалер двох орденів Леніна, лавреат Сталінської премії та Національної премії імені Тараса Шевченка.',
  ),
];

class PoetsListPage extends StatelessWidget {
  const PoetsListPage({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: const Text('Українські поети'),
      ),
      body: ListView.builder(
        itemCount: poets.length,
        itemBuilder: (context, index) {
          return ListTile(
            leading: CircleAvatar(
              backgroundImage: AssetImage(poets[index].imageAsset),
            ),
            title: Text(poets[index].name),
            onTap: () {
              Navigator.push(
                context,
                MaterialPageRoute(
                  builder: (context) => PoetDetailPage(poet: poets[index]),
                ),
              );
            },
          );
        },
      ),
    );
  }
}

class PoetDetailPage extends StatelessWidget {
  final PoetInfo poet;

  const PoetDetailPage({super.key, required this.poet});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Text(poet.name),
      ),
      body: Padding(
        padding: const EdgeInsets.all(16.0),
        child: Column(
          crossAxisAlignment: CrossAxisAlignment.center,
          children: [
            Image.asset(poet.imageAsset),
            const SizedBox(height: 16),
            Text(poet.description),
          ],
        ),
      ),
    );
  }
}
